Caixa 1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       281600;
    }
    outlet
    {
        type            patch;
        nFaces          2400;
        startFace       284000;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8000;
        startFace       286400;
    }
)

// ************************************************************************* //
