Caixa 1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-50  0   -11.97) //1
    ( 200 0   -11.97) //2
    ( 200 20.9 -11.97) //6
    (-50 20.9 -11.97) //5
    (-50  0    11.97) //3
    ( 200 0    11.97) //4
    ( 200 20.9  11.97) //7
    (-50 20.9  11.97) //8
    //(-0.5 0   -0.5) //1
    //( 0.5 0   -0.5) //2
    //( 0.5 1.0 -0.5) //6
    //(-0.5 1.0 -0.5) //5
    //(-0.5 0    0.5) //3
    //( 0.5 0    0.5) //4
    //( 0.5 1.0  0.5) //7
    //(-0.5 1.0  0.5) //8

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 1 2 3)
            (1 5 6 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
